In [1]:
import pandas as pd
import numpy as np

In [2]:
import os

In [3]:
os.getcwd()

'C:\\Users\\ASUS\\OneDrive\\Desktop\\aiQuest\\Assignment_06'

In [4]:
os.chdir('C:\\Users\\rashe\\Documents')

FileNotFoundError: [WinError 3] The system cannot find the path specified: 'C:\\Users\\rashe\\Documents'

In [62]:
os.getcwd()

'C:\\Users\\ASUS\\OneDrive\\Desktop\\aiQuest\\Assignment_06'

In [63]:
df = pd.read_csv("insurance.csv")
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

# Replace

In [64]:
df_ml = df.copy()
df_l = df.copy()
df_l2 = df.copy()
df_oh = df.copy()
df_or = df.copy()

In [65]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [66]:
df.sex.value_counts()

male      676
female    662
Name: sex, dtype: int64

In [67]:
df.smoker.value_counts()

no     1064
yes     274
Name: smoker, dtype: int64

In [68]:
df.region.value_counts()

southeast    364
southwest    325
northwest    325
northeast    324
Name: region, dtype: int64

In [69]:
df.sex = df.sex.replace(['female','male'],[1,2])
df.smoker = df.smoker.replace(['yes','no'],[1,0])
df.region = df.region.replace(['southeast','southwest','northwest','northeast'],[4,3,2,1])
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    1  27.900         0       1       3  16884.92400
1   18    2  33.770         1       0       4   1725.55230
2   28    2  33.000         3       0       4   4449.46200
3   33    2  22.705         0       0       2  21984.47061
4   32    2  28.880         0       0       2   3866.85520

# Label Encoder

In [70]:
#manually

In [71]:
df_ml.sex = df_ml.sex.replace(['female','male'],[1,2])
df_ml.smoker = df_ml.smoker.replace(['yes','no'],[1,0])
df_ml.region = df_ml.region.replace(['southeast','southwest','northwest','northeast'],[4,3,2,1])
df_ml.head()

   age  sex     bmi  children  smoker  region      charges
0   19    1  27.900         0       1       3  16884.92400
1   18    2  33.770         1       0       4   1725.55230
2   28    2  33.000         3       0       4   4449.46200
3   33    2  22.705         0       0       2  21984.47061
4   32    2  28.880         0       0       2   3866.85520

In [72]:
#loop

In [73]:
df_l.sex.value_counts()

male      676
female    662
Name: sex, dtype: int64

In [74]:
df_l.smoker.value_counts()

no     1064
yes     274
Name: smoker, dtype: int64

In [75]:
df_l.region.value_counts()

southeast    364
southwest    325
northwest    325
northeast    324
Name: region, dtype: int64

In [76]:
for (columnName, columnData) in df_l.iteritems():
    if(df_l[columnName].dtype == 'object'):
        enc_value = 1
        for value, counts in df_l[columnName].value_counts().items():
            df_l[columnName] = df_l[columnName].replace([value],[enc_value])
            enc_value += 1
df_l.head()

   age  sex     bmi  children  smoker  region      charges
0   19    2  27.900         0       2       2  16884.92400
1   18    1  33.770         1       1       1   1725.55230
2   28    1  33.000         3       1       1   4449.46200
3   33    1  22.705         0       1       3  21984.47061
4   32    1  28.880         0       1       3   3866.85520

In [77]:
df_l.sex.value_counts()

1    676
2    662
Name: sex, dtype: int64

In [78]:
df_l.smoker.value_counts()

1    1064
2     274
Name: smoker, dtype: int64

In [79]:
df_l.region.value_counts()

1    364
2    325
3    325
4    324
Name: region, dtype: int64

# Loop Using label Encoder

In [84]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [85]:
for (columnName, columnData) in df_l2.iteritems():
    if(df_l2[columnName].dtype == 'object'):
        df_l2[columnName] = le.fit_transform(df_l2[columnName])
df_l2.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# One Hot Encoding

In [87]:
for (columnName, columnData) in df_oh.iteritems():
    if(df_oh[columnName].dtype == 'object'):
        one = pd.get_dummies(df_oh[columnName], drop_first=True, prefix='One_Hot_'+columnName)
        df_oh.drop(df_oh[[columnName]], axis=1,inplace=True)
        df_oh=pd.concat([df_oh,one], axis=1)
df_oh.head()

,age,bmi,children,charges,One_Hot_sex_male,One_Hot_smoker_yes,One_Hot_region_northwest,One_Hot_region_southeast,One_Hot_region_southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

# Ordinal

In [88]:
from sklearn.preprocessing import OrdinalEncoder

In [89]:
df_or.sex.value_counts()

male      676
female    662
Name: sex, dtype: int64

In [90]:
df_or.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [92]:
for (columnName, columnData) in df_or.iteritems():
    if(df_or[columnName].dtype == 'object'):
        col_unq_val = df_or[columnName].unique()
        ordinal = OrdinalEncoder(categories=[col_unq_val])
        encoded = ordinal.fit_transform(df_or[[columnName]])
        df_or[columnName] = encoded
df_or.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520